In [1]:
import pandas as pd
import os

In [2]:
#locate directory
os.getcwd()

'C:\\Users\\memus\\Class\\School_District_Analysis'

In [3]:
#update new directory of File
os.chdir('C:\\Users\\memus\\OneDrive\\Desktop\\Analysis Project\Module 4 - PyCitySchools with Pandas\Resources')

In [4]:
os.getcwd()

'C:\\Users\\memus\\OneDrive\\Desktop\\Analysis Project\\Module 4 - PyCitySchools with Pandas\\Resources'

In [5]:
#Import the data
student_data = os.path.join('../Resources/new_full_student_data.csv')
student_df = pd.read_csv(student_data)

In [6]:
#Check Pandas correctly imported the data
student_df.head()

,student_id,student_name,grade,school_name,reading_score,math_score,school_type,school_budget
0,103880842,Travis Martin,9th,Sullivan High School,59.0,88.2,Public,961125
1,45069750,Michael Brown,9th,Dixon High School,94.7,73.5,Charter,870334
2,45024902,Gabriela Lucero,9th,Wagner High School,89.0,70.4,Public,846745
3,62582498,Susan Richardson,9th,Silva High School,69.7,80.3,Public,991918
4,16437227,Sherry Davis,11th,Bowers High School,NaN,27.5,Public,848324

In [7]:
#Check for any NaN values in the data
student_df.isna().sum()

student_id          0
student_name        0
grade               0
school_name         0
reading_score    1968
math_score        982
school_type         0
school_budget       0
dtype: int64

In [8]:
#Drop any rows that contain NaN values, then verify that no NaN values remain
student_df = student_df.dropna()
student_df.isna().sum()

student_id       0
student_name     0
grade            0
school_name      0
reading_score    0
math_score       0
school_type      0
school_budget    0
dtype: int64

In [9]:
student_df.isna().sum()

student_id       0
student_name     0
grade            0
school_name      0
reading_score    0
math_score       0
school_type      0
school_budget    0
dtype: int64

In [10]:
# Check for fuplicated rows
student_df.duplicated().sum()

1836

In [11]:
#Drop duplications
student_df = student_df.drop_duplicates()
student_df.duplicated().sum()

0

In [12]:
#Check the data types
student_df.dtypes

student_id         int64
student_name      object
grade             object
school_name       object
reading_score    float64
math_score       float64
school_type       object
school_budget      int64
dtype: object

In [13]:
#Remove symbols
student_df['grade'] = student_df['grade'].str.replace('th','')
student_df['grade']

0         9
1         9
2         9
3         9
5         9
         ..
19508    10
19509    12
19511    11
19512    11
19513    12
Name: grade, Length: 14831, dtype: object

In [14]:
#Change the type of "grade" to int
student_df['grade'] =student_df['grade'].astype(int)
student_df.dtypes

student_id         int64
student_name      object
grade              int32
school_name       object
reading_score    float64
math_score       float64
school_type       object
school_budget      int64
dtype: object

In [15]:
#Generate the summary statistics for the student.
student_df.describe()

         student_id         grade  reading_score    math_score  school_budget
count  1.483100e+04  14831.000000   14831.000000  14831.000000   14831.000000
mean   6.975296e+07     10.355539      72.357865     64.675733  893742.749107
std    3.452909e+07      1.097728      15.224590     15.844093   53938.066467
min    1.000906e+07      9.000000      10.500000      3.700000  817615.000000
25%    3.984433e+07      9.000000      62.200000     54.500000  846745.000000
50%    6.965978e+07     10.000000      73.800000     65.300000  893368.000000
75%    9.927449e+07     11.000000      84.000000     76.000000  956438.000000
max    1.299997e+08     12.000000     100.000000    100.000000  991918.000000

In [16]:
#Display the mean math score.
max_math_score = student_df['math_score'].mean()
max_math_score

64.6757332614119

In [17]:
#Store the minimum reading score.
min_reading_score = student_df['reading_score'].min()
min_reading_score

10.5

In [18]:
#Display the grade column.
student_df.loc[:,'grade']

0         9
1         9
2         9
3         9
5         9
         ..
19508    10
19509    12
19511    11
19512    11
19513    12
Name: grade, Length: 14831, dtype: int32

In [19]:
#Select the first three row of Columns 3, 4, 5.
student_df.iloc[:3,[3,4,5]].head()

            school_name  reading_score  math_score
0  Sullivan High School           59.0        88.2
1     Dixon High School           94.7        73.5
2    Wagner High School           89.0        70.4

In [20]:
#Select the rows for Grade 9 and display their summary statistics.
grade_9_df = student_df.loc[student_df["grade"]== 9]

In [21]:
grade_9_df

,student_id,student_name,grade,school_name,reading_score,math_score,school_type,school_budget
0,103880842,Travis Martin,9,Sullivan High School,59.0,88.2,Public,961125
1,45069750,Michael Brown,9,Dixon High School,94.7,73.5,Charter,870334
2,45024902,Gabriela Lucero,9,Wagner High School,89.0,70.4,Public,846745
3,62582498,Susan Richardson,9,Silva High School,69.7,80.3,Public,991918
5,74579444,Cynthia Johnson,9,Montgomery High School,63.5,76.9,Charter,893368
...,...,...,...,...,...,...,...,...
19477,14165038,William Smith,9,Dixon High School,69.8,65.0,Charter,870334
19478,46569330,Angie Flowers,9,Bowers High School,50.4,61.7,Public,848324
19481,99423494,Sherry Rogers,9,Silva High School,47.0,88.4,Public,991918
19493,68274108,Mary Murray,9,Wagner High School,63.4,53.4,Public,846745
19497,56856952,Joshua Holmes,9,Wagner High School,77.2,76.5,Public,846745

In [22]:
#Store the row that contains the MIN reading score
min_reading_score = student_df["reading_score"].min()
min_reading_row = student_df.loc[student_df["reading_score"] ==min_reading_score]
min_reading_row

,student_id,student_name,grade,school_name,reading_score,math_score,school_type,school_budget
3706,81758630,Matthew Thomas,10,Dixon High School,10.5,58.4,Charter,870334

In [23]:
#Select all the reading score from the 10th graders at Dixon High School.
Dixon_10_reading = student_df.loc[(student_df["grade"] == 10) & (student_df["school_name"] == 'Dixon High School')]
Dixon_10_reading.loc[:,["school_name", "reading_score"]]

             school_name  reading_score
45     Dixon High School           71.1
60     Dixon High School           59.5
69     Dixon High School           88.6
94     Dixon High School           81.5
100    Dixon High School           95.3
...                  ...            ...
19283  Dixon High School           52.9
19306  Dixon High School           58.0
19344  Dixon High School           38.0
19368  Dixon High School           84.4
19445  Dixon High School           43.9

[569 rows x 2 columns]

In [24]:
#Find the mean reading score for all the students in Grade 11 and 12. (Delivered 4 Q6).
reading_score_11_12 = student_df.loc[(student_df["grade"] == 11) | (student_df["grade"] == 12)]
reading_score_11_12.loc[:,["reading_score"]].mean()

reading_score    74.900381
dtype: float64

In [25]:
#Display the avg. budget for each school type.
avg_budget = student_df.groupby(by='school_type').mean()
avg_budget.loc[:, ["school_budget"]]

             school_budget
school_type
Charter      872625.656236
Public       911195.558251

In [31]:
#Find the total number of students at each school. Sort those numbers from largest to smallest
total_student_count = student_df.groupby('school_name').count().sort_values('grade', ascending = False)
total_student_count

,student_id,student_name,grade,reading_score,math_score,school_type,school_budget
school_name,,,,,,,
Montgomery High School,2038,2038,2038,2038,2038,2038,2038
Green High School,1961,1961,1961,1961,1961,1961,1961
Dixon High School,1583,1583,1583,1583,1583,1583,1583
Wagner High School,1541,1541,1541,1541,1541,1541,1541
Silva High School,1109,1109,1109,1109,1109,1109,1109
Woods High School,1052,1052,1052,1052,1052,1052,1052
Sullivan High School,971,971,971,971,971,971,971
Turner High School,846,846,846,846,846,846,846
Bowers High School,803,803,803,803,803,803,803
Fisher High School,798,798,798,798,798,798,798
Richard High School,551,551,551,551,551,551,551
Campos High School,541,541,541,541,541,541,541
Odonnell High School,459,459,459,459,459,459,459
Campbell High School,407,407,407,407,407,407,407
Chang High School,171,171,171,171,171,171,171

In [27]:
#Find the avg. math score by grade for each school type.
avg_by_school = student_df.groupby(['school_type', 'grade']).mean()
avg_by_school.loc[:, ["math_score"]]

                   math_score
school_type grade
Charter     9       70.077874
            10      66.443206
            11      68.024735
            12      60.212121
Public      9       63.771066
            10      63.764121
            11      59.314337
            12      63.568319